;;; Process command line arguments, and call into driver.pco functions
;;; to perform the specified action.

(define (main)
  (define command (second command-line-args))
  (define files (cddr command-line-args))
  (cond ((string-equal? command "expand")
         (do-expand-files files))
        ((string-equal? command "interpret")
         (do-interpret-files files '(runtime-main)))
        ((string-equal? command "compile")
         (do-compile-files files '(runtime-main)))))
